{
  "slate_navbar_desc": "Please hold on tightly to the navigation bar; don't forget why you started just because you've gone too far.",
  "s_nb_smooth_d": "There are intuitive entrance, exit, and transition animations.",
  "s_nb_key_d": "Let your focus dance by pressing <1>Tab</1> and <3>Esc<3>.",
  "s_nb_a11y_d": "There are standardized ARIA attributes, ensuring accessibility.",
  "s_nb_style_d": "Style each element to make each navigation menu unique.",
  "o": "...",
  "s_nb_doc_t1": "Installation and Usage",
  "s_nb_doc_t2": "API",
  "s_nb_doc_t3": "Keyboard Interactions",
  "s_nb_doc_t4": "Development and Maintenance Direction",
  "s_nb_doc_t1_link": "https://github.com/wswmsword/hanav/blob/main/README_EN.md#installation-and-usage",
  "s_nb_doc_t2l": "https://github.com/wswmsword/hanav/blob/main/README_EN.md#api",
  "s_nb_doc_t3l": "https://github.com/wswmsword/hanav/blob/main/README_EN.md#keyboard-interactions",
  "s_nb_doc_t4l": "https://github.com/wswmsword/hanav/blob/main/README_EN.md#development-and-maintenance-direction",

  "motion": "motion",
  "mini": "mini-mode",

  "s_mforever_desc": "<0>postcss-mobile-forever</0> is a PostCSS plugin designed for mobile adaptation. It can be used together with <2>scale-view</2>, with the former being used during the compilation phase and the latter during the runtime phase.",
  "s_mf_doc_t1": "Demo",
  "s_mf_doc_t2": "Mobile Templates and Examples",
  "s_mf_doc_t3": "Installation",
  "s_mf_doc_t4": "Configuration Parameters",
  "s_mf_doc_t5": "Unit Testing and Contributing",
  "s_mf_doc_t6": "Input/Output Examples and Principles",

  "s_ffly_t1": "Warm-Up",
  "s_ffly_d1": "Want to have a great night? Start with a warm-up.",
  "s_ffly_t2": "Dialog",
  "s_ffly_d2": "When developing dialogs, pay attention to focus management. Dialogs are common but often have accessibility issues.",
  "s_ffly_t3": "Navigation Bar",
  "s_ffly_d3": "Some are at the top, some on the side; each navigation menu is unique.",
  "s_ffly_t4": "Tabs",
  "s_ffly_d4": "Switch tabs to display the corresponding panels. Switching can be automatic or manual.",
  "s_ffly_t5": "Playlist",
  "s_ffly_d5": "The music platform Spotify has great keyboard navigation on its website, with playlists being one example.",
  "s_ffly_t6": "Infinite Scroll",
  "s_ffly_d6": "Bottomless infinite scrolling",

  "desc": "hanav is a React navigation menu component library that includes a set of triggers and a corresponding set of menu panels. Users can expand, switch, and collapse the menu panels through the triggers. The navigation menu typically appears at the top of a website, providing the most desired links and other controls for users.",
  "tooltip": "After switching off 'Reduce Motion' under operating system, it will synchronize the motion options.",
  "tooltip2": "After switching off '<1>Reduce Motion</1>' under operating system, it will synchronize the motion options.",
  "smooth_t": "Smooth Transition",
  "smooth_d": "There are intuitive entry, exit, and transition animations. After the exit animation ends, the disappeared panel will be removed from the DOM.",
  "key_t": "Keyboard Navigation",
  "key_d": "Pressing <1>Tab</1> and <3>Esc</3> to navigate, users can freely choose mouse or keyboard access.",
  "a11y_t": "Assistive Devices Navigation",
  "a11y_d": "There are standardized ARIA attributes, ensuring accessibility, and the content can be accessed using assistive devices like TalkBack or VoiceOver.",
  "style_t": "Highly Customizable",
  "style_d": "The rendered DOM corresponds one-to-one with the components, allowing styles to be set for each element and enabling the customization of transition animations.",
  "mobile_t": "Mobile-Friendly Design",
  "mobile_d": "Provides a series of components specifically designed for mobile devices, allowing you to select 'Mini Mode' or switch to a mobile device experience.",
  "dx_t": "Excellent Developer Experience",
  "dx_d": "The usage closely aligns with the structure of the rendered output, with different functionalities corresponding to specific components, making it simple, intuitive, and efficient.",
  "usage": "The usage of hanav is very simple, providing an intuitive and straightforward API, offering a great development experience. For detailed usage instructions, please refer to <1>the hanav GitHub repository homepage</1>.",
  "stars": "Amidst the twinkling sea of stars, please hold tight to the navigation-153."
}